Lakshyaa1/physical-atari-rlc/devbox_code/esp32_joystick_bridge/esp_idf/sdkconfig.defaults
# Classic ESP32 (this board is an ESP32-D0WD-V3).
CONFIG_IDF_TARGET="esp32"

# Console on UART0 at 115200 -- the devbox opens the port at 115200 by default
# (--baud=N overrides). This must match or the link is silent.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200

# Keep the binary stream clean. The boot log is ASCII and the devbox discards it
# (every byte fails the bit-7 frame test), but there is no reason to emit it
# into a data stream, and a quieter boot means less to resync past on reset.
CONFIG_BOOTLOADER_LOG_LEVEL_NONE=y
CONFIG_BOOTLOADER_LOG_LEVEL=0
CONFIG_LOG_DEFAULT_LEVEL_NONE=y
CONFIG_LOG_DEFAULT_LEVEL=0

# 1 kHz FreeRTOS tick. The default is 100 Hz, which makes pdMS_TO_TICKS(1) round
# DOWN TO ZERO -- the sample loop then runs at one tick (10 ms) instead of 1 ms,
# so the bridge silently samples at 100 Hz and the 3-sample debounce stretches
# from 3 ms to 30 ms, long enough to swallow a quick tap. Measured before this
# change: exactly 100 frames/s.
CONFIG_FREERTOS_HZ=1000
